{
  "color": 300,
  "url": "",
  "tips": [
    "Breaking blocks and making loud noises can attract zombies.",
    "Zombies may investigate light sources if they're close enough.",
    "Take time to stash your food. Crops won't grow during winter!",
    "Bloodmoons are rare but very dangerous!",
    "Invasions occur every 9th night.",
    "Try mining below y=0 (bedrock)!",
    "Onyx can create the best armor in the game.",
    "Mythril items are known for their magical properties.",
    "Adamantium is very fast and strong, but has weak durability.",
    "The Beneath contains very large dungeons with great loot.",
    "You can't sleep during Bloodmoons, invasions, and thunderstorms.",
    "Difficulty increases and decreases depending on many factors.",
    "The higher the difficulty, the more health and damage mobs have!",
    "A Rime and Steel lets you create a Nether portal of any size and orientation.",
    "The Ghast Queen is a rare Nether boss that spawns Ghastlings.",
    "Frosted Amedian tools make you immune to wither damage.",
    "Wither Bone armor makes skeletal types will never attack you.",
    "Soulforged Steel is the best ingot for pickaxes in the game.",
    "The Onyx Bow is a very powerful late game weapon.",
    "The day-night cycle is twice as long as vanilla Minecraft.",
    "Zombies can pillar up to you if you're above them.",
    "Zombies with pickaxes will mine to get to you!",
    "You can carry a chest by shift+right-clicking it.",
    "You can carry chickens and baby livestock by shift+right-clicking them.",
    "Pirate ships hold rare loot, but are invested with dead pirates!",
    "Try duel-wielding swords!",
    "Sleeping significantly lowers your hunger.",
    "Mythril, Onyx, and Adamantium are the 3 late game ores.",
    "Silver is slightly better than iron, but can't mine ores like diamond and redstone!",
    "Join our Discord and discuss base defense strategies!",
    "Out of bookshelves? Place candles to boost an enchanting table's power.",
    "You can change an accesories modifier with a Reforging Station.",
	"Bones can be turned into stock. Tasty, cheap, and a great ingredient",
	"Craft or find a backpack to haul more junk along with you.",
    "A lava moat around your base is one of the best defenses.",
    "The darkness damages you while in The Beneath.",
    "With each death, you gain knowledge to prevent the next death.",
    "Flint tools?  No, we don't torture you that way here.",
    "Tree punching is still here!",
    "In most cases, the more ingredients you use, the more hunger you restore.",
    "Berry bushes and fruit trees are great for early game food.",
  ]
}