{
  "key": {
    "id": "captain_letter",
    "category": "overworld"
  },
  "content": {
    "title": "An old letter",
    "body": "My dearest wife,\nI received your letter. I am glad that our little soldier is doing fine in the academy, I wouldn't expect less from the daughter of the captain and the strongest war sister on the South Wall. Regardless of what those buffons at the magic university always say, here place is with us in the military, and I am sure that she will surpass us both one day.\nThere was this matter that I wanted to share with you; the other day we received a dozen refugees at the West Gate. According to their elder, it would appear that they had been travelling for a whole week to get to the capital after their village was completely devastated by a conflict between two cyclops. Both of the brutes had decided to come to the village and steal the cattle from the populace but could not agree to split the loot, so they started a rampage.\nIn any case, other than people travelling in the wilderness, nothing too strange, except one villager told me something I found to be puzzling. As you know, I never miss the chance to learn about the beasts and animals that round these parts of the world, yet this one girl told me about this thing that she saw in the night when they were camping; a pair of bright purple eyes observing her from the darkness tall as a tree. She told me that after a split second the eyes disappeared and she felt a slight sting in her arm. Where the eyes stood, only a handful of suspended purplish particles remained. The only reason I did not disregard her story as a prank by some pixie was because of strange stain on her skin where she had felt the sting. I adviced her to go to the infirmary, rest a little and explain to me in more detail what she saw. It could be an interesting new species that I can add to the bestiary, and I am sure that our daughter would be delighted to go on a hunt, the thought of it makes me laugh!\nIf all goes well, I should be back by the end of the week, I can barely wait to see both of you again, so wait for me.\nYours truly,\nThe Captain of the West Wall and a proud husband."
  },
  "sortingIndex": 0,
  "requirements": [],
  "autoAdd": true,
  "defaultLore": false,
  "trigger": null,
  "action": null
}